Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: If you notice that &productName; works slowly, consider the possibility to reduce the number of folders under antivirus protection.
zh_cn: 如果你注意到 &productName; 工作缓慢，考虑一下减少防病毒保护下的文件夹数量的可能性。

source: If you notice that IntelliJ IDEA works slowly, consider the possibility to reduce the number of folders under antivirus protection.
zh_cn: 如果你注意到 &productName; 工作缓慢，考虑一下减少防病毒保护下的文件夹数量的可能性。

source: If you open it, your project is likely to be corrupted.
zh_cn: 如果您打开它，您的项目可能会被损坏。

source: If you place the caret at certain symbol and press &shortcut:Refactorings.QuickListPopupAction;, you will see the list of refactorings applicable to the current context.
zh_cn: 如果你把插入符号放到某符号处并按下 &shortcut:Refactorings.QuickListPopupAction;，你将会看到适用于当前上下文的重构列表。

source: If you run your application or tests with Coverage, you can see the coverage data in the Coverage tool window per class and package as well in the editor per each line of code.
zh_cn: 如果使用 Coverage 运行应用程序或测试，则可以在每行代码的每个类和程序包以及编辑器中的 Coverage 工具窗口中查看覆盖率数据。

source: If you type an asterisk, PyCharm will show the complete list of all the available tasks.
zh_cn: 如果输入星号，PyCharm 将显示所有可用任务的完整列表。

source: If you want the method you chose to be imported statically, press &shortcut:ShowIntentionActions; and see what happens:
zh_cn: 如果你想让你选择的方法静态导入，按下 &shortcut:ShowIntentionActions; 看会发生什么。

source: If you want to return to the original text, right-click such a blue template, and choose Restore defaults on the context menu.
zh_cn: 如果要恢复原始文本，请右键单击此蓝色模板，然后在上下文菜单上选择Restore defaults（恢复默认值）。

source: If you want to use block comments, press &shortcut:CommentByBlockComment; (Code | Comment with Block Comment).
zh_cn: 如果想使用块注释，按 &shortcut:CommentByBlockComment; (Code | Comment with Block Comment)。

source: If you would like to get notified when the exceptions you submit are fixed, please fill in your JetBrains Account login and password.
zh_cn: 如果您希望在您提交的异常修复时获得通知， 请填写您的 JetBrains 帐户登录名和密码。

source: If you've changed a live template, it becomes blue.
zh_cn: 如果您更改了代码模板，则它会变成蓝色。

source: If your code references an undeclared method or field, you can quickly declare it automatically with the correct signature or type, by pressing &shortcut:ShowIntentionActions; and choosing the corresponding quick-fix.
zh_cn: 如果您的代码引用了未声明的方法或字段，则可以通过按 &shortcut:ShowIntentionActions; 并选择相应的快速修复，使用正确的签名或类型自动快速声明它。

source: Ignore
zh_cn: 忽略

source: Ignore Javadoc pointing to itself
zh_cn: 忽略指向自身的 Javadoc

source: Ignore Left Side
zh_cn: 忽略左侧

source: Ignore Right Side
zh_cn: 忽略右侧

source: Ignore Selected
zh_cn: 忽略所选

source: Ignore Unversioned Files
zh_cn: 忽略未加入版本控制的文件

source: Ignore all files &matching
zh_cn: 忽略所有匹配的文件(&M)

source: Ignore all files &under
zh_cn: 忽略其下的所有文件(&U)

source: Ignore contents of toString() method
zh_cn: 忽略 toString() 方法的内容

source: Ignore duplicate 'throws' tag
zh_cn: 忽略重复的 'throws' 标记

source: Ignore duplicated code in sources marked as generated
zh_cn: 忽略标记为生成的源码中的重复

source: Ignore elements marked as @deprecated
zh_cn: 忽略标记为 @deprecated 的元素

source: Ignore exceptions subclassing others
zh_cn: 忽略其他异常子类

source: Ignore external resource
zh_cn: 忽略外部资源

source: Ignore files and folders
zh_cn: 忽略文件和文件夹

source: Ignore for JUnit assert arguments
zh_cn: 忽略 JUnit 断言参数

source: Ignore for assert statement arguments
zh_cn: 忽略 assert 语句参数

source: Ignore for exception constructor arguments:
zh_cn: 忽略 exception 构造函数参数:

source: Ignore for specified exception constructor arguments
zh_cn: 忽略指定的 exception 构造函数参数

source: Ignore lines containing this comment (pattern in java.util.Pattern format):
zh_cn: 忽略包含此注释的行(java.util.Pattern 格式的模式)：

source: Ignore literals assigned to constants
zh_cn: 忽略分配给常量的文字

source: Ignore literals which do not contain alphabetic characters
zh_cn: 忽略不包含字母字符的文字

source: Ignore literals which have value equal to existing property key
zh_cn: 忽略值与现有属性键名相等的文字

source: Ignore literals which have value equal to existing qualified class name
zh_cn: 忽略值与现有完全限定类名相等的文字

source: Ignore period problems
zh_cn: 忽略句号问题

source: Ignore simple property accessors
zh_cn: 忽略简单的属性访问器

source: Ignore spaces
zh_cn: 忽略空格

source: Ignore specified &file
zh_cn: 忽略指定文件(&F)

source: Ignore whitespace:
zh_cn: 忽略空白：

source: Ignore...
zh_cn: 忽略...

source: Ignored
zh_cn: 忽略的

source: Ignored Files
zh_cn: 忽略的文件

source: Ignored Updates
zh_cn: 忽略更新

source: Illegal character
zh_cn: 非法字符

source: Illegal combination of modifiers: ''{0}'' and ''{1}''
zh_cn: 修饰符的非法组合：''{0}'' 和 ''{1}''

source: Illegal escape character in character literal
zh_cn: 字符文字中的非法转义字符

source: Illegal escape character in string literal
zh_cn: 字符串文字中的非法转义字符

source: Illegal forward reference
zh_cn: 非法前向引用

source: Illegal generic type for instanceof
zh_cn: 用于 instanceof 的非法通用类型

source: Illegal initializer for ''{0}''
zh_cn: ''{0}'' 的非法初始化

source: Illegal line end in character literal
zh_cn: 字符文字中的非法行结尾

source: Illegal line end in string literal
zh_cn: 字符串文字中的非法行结尾

source: Illegal package dependencies
zh_cn: 非法的包依赖关系

source: Illegal scheme name
zh_cn: 非法方案名称

source: Illegal self reference
zh_cn: 非法自身引用

source: Illegal type: 'void'
zh_cn: 非法类型： 'void'

source: Illegal underscore
zh_cn: 非法下划线

source: Image size mismatch
zh_cn: 图像尺寸不匹配

source: Immutable object is modified
zh_cn: 不可变对象被修改

source: Immutable object is passed where mutable is expected
zh_cn: 在期望可变对象的地方传递了不可变对象

source: Implement Abstract Method
zh_cn: 实现抽象方法

source: Implement Method
zh_cn: 实现方法

source: Implement Method (from Method Hierarchy)
zh_cn: 实现方法(从方法层次结构)

source: Implement abstract class
zh_cn: 实现抽象类

source: Implement abstract class or interface
zh_cn: 实现抽象类或接口

source: Implement abstract method
zh_cn: 实现抽象方法

source: Implement base interface/class methods in the current class
zh_cn: 在当前类中实现基本接口/类方法

source: Implement interface
zh_cn: 实现接口

source: Implement method
zh_cn: 实现方法

source: Implement method ''{0}''
zh_cn: 实现方法 ''{0}''

source: Implement methods
zh_cn: 实现方法

source: Implementations of {0}
zh_cn: {0} 的实现

source: Implementing Classes
zh_cn: 实现类

source: Implementing Methods
zh_cn: 实现方法

source: Implements method ''{0}'' in <a href="#javaClass/{1}">{1}</a>
zh_cn: 在 <a href="#javaClass/{1}">{1}</a> 中的实现方法 ''{0}''

source: Implements method in <a href="#javaClass/{1}">{1}</a>
zh_cn: 在 <a href="#javaClass/{1}">{1}</a> 中的实现方法

source: Import
zh_cn: 导入

source: Import &popup
zh_cn: 导入弹窗(&P)

source: Import File Location
zh_cn: 导入文件位置

source: Import From
zh_cn: 导入源

source: Import From Eclipse...
zh_cn: 从 Eclipse 导入...

source: Import Layout
zh_cn: 导入布局

source: Import Module
zh_cn: 导入模块

source: Import Project
zh_cn: 导入项目

source: Import Scheme
zh_cn: 导入方案

source: Import Settings
zh_cn: 导入设置

source: Import Settings...
zh_cn: 导入设置...

source: Import _From JBuilder...
zh_cn: 从 JBuilder 导入...(_F)

source: Import _Projects
zh_cn: 导入项目(_P)

source: Import class
zh_cn: 导入类

source: Import failed: {0} is not a valid scheme.
zh_cn: 导入失败：{0} 不是有效的方案。

source: Import from {0}
zh_cn: 从 {0} 导入

source: Import global settings
zh_cn: 导入全局设置

source: Import iml file as a module to the project
zh_cn: 导入 iml 文件作为一个模块到项目

source: Import into Version Control
zh_cn: 导入到版本控制

source: Import module from directory with existing sources or from existing project model
zh_cn: 根据现有的源码目录创建模块或转换现有的项目模型

source: Import static constant
zh_cn: 导入静态常量

source: Import static method
zh_cn: 导入静态方法

source: Import {0}
zh_cn: 导入 {0}

source: Import {0} from external &model
zh_cn: 从外部模型导入 {0}(&M)

source: Import {0} settings from:
zh_cn: 导入 {0} 设置从：

source: Import...
zh_cn: 导入...

source: Important
zh_cn: 重要的

source: Imported From {0}
zh_cn: 已从 {0} 导入

source: ImportedFrom{0}
zh_cn: 已从 {0} 导入

source: Imports
zh_cn: 导入

source: In &Project
zh_cn: 在项目中(&P)

source: In &whole project
zh_cn: 在整个项目(&W)

source: In (fully qualified name):
zh_cn: 在 (完全限定名称):

source: In &productName;, you can have multiple cursors.
zh_cn: 在 &productName; 中，你可以有多个光标。

source: In Comments
zh_cn: 在注释中

source: In String Literals
zh_cn: 在字符串中

source: In Ternary Operator (?:)
zh_cn: 在三元运算符(?:)

source: In addition to Basic Completion and Smart Completion, which offer suggestions based on language semantics, you can use suggestions based on words used in the current file.
zh_cn: 除 Basic Completion 和 Smart Completion，它们提供基于语言语义的建议外，还可以使用基于当前文件中使用的单词的建议。

source: In an already existing project (Settings/Preferences - Project <project name> - Project Interpreter).
zh_cn: 在已存在的项目中 (Settings/Preferences - Project <project name> - Project Interpreter)。

source: In class declaration
zh_cn: 在类声明

source: In code:
zh_cn: 在代码中:

source: In declarations:
zh_cn: 在声明中:

source: In empty tag
zh_cn: 在空标签

source: In lambda declaration
zh_cn: 在 lambda 声明中

source: In method declaration
zh_cn: 在方法声明

source: In order to do this press the "Export" button on the toolbar to the left from the results tree.
zh_cn: 为此，请在结果树左侧的工具栏上的点击 "Export（导出）" 按钮。

source: In order to generate ant build script, please select the "main" (representative) module for each dependency cycle.
zh_cn: 为了生成 ant 构建脚本，请为每个依赖循环选择 "主"(代表)模块。

source: In order to invoke the refactoring, move the cursor over the local variable and press &shortcut:Inline; (Refactor | Inline... ).
zh_cn: 为了调用重构，将光标移到局部变量上并按 &shortcut:Inline;(Refactor | Inline... )。

source: In order to invoke the refactoring, move the cursor over the local variable to apply the refactoring to
zh_cn: 为了调用重构，将光标移到局部变量上以应用重构

source: In order to invoke the refactoring, move the cursor over the method caller and press &shortcut:Inline; (Refactor | Inline... ):
zh_cn: 为了调用重构，将光标移到方法调用者上并按下 &shortcut:Inline;(Refactor | Inline... )：

source: In order to invoke the refactoring, select an expression to be replaced with a constant or place the caret over an expression and press &shortcut:IntroduceConstant; (Refactor | Extract -> Constant... ):
zh_cn: 为了调用这个重构，选择一个用要用常量代替的表达式，按 &shortcut:IntroduceConstant; (Refactor | Extract Constant)。

source: In order to invoke the refactoring, select an expression to be replaced with a field or place the caret over an expression and press &shortcut:IntroduceField; (Refactor | Extract -> Field... ):
zh_cn: 为了调用这个重构，选择一个用要用字段代替的表达式，按 &shortcut:IntroduceField; (Refactor | Extract -> Field... ):

source: In order to invoke the refactoring, select an expression to be replaced with a parameter or place the caret over an expression and press &shortcut:IntroduceParameter; (Refactor | Extract -> Parameter... ):
zh_cn: 为了调用重构，请选择一个要用参数替换的表达式，或将插入符号放在表达式上，然后按 &shortcut:IntroduceParameter;(Refactor | Extract -> Parameter... )：

source: In particular, it is possible to edit regular expressions.
zh_cn: 特别是可以编辑正则表达式。

source: In s&ingle module
zh_cn: 在单个模块(&I)

source: In the Live Templates settings, use speed search to find templates with certain text in the template abbreviation, body or description.
zh_cn: 在 Live Templates（代码模板） 设置中，使用快速搜索来查找在模板缩写、内容或描述中包含某些文字的模板。

source: In the Project tool window, select the file you want to ignore, and choose Mark as plain text in its context menu.
zh_cn: 在 Project 工具窗口中，选择想要忽略的文件，然后在上下文菜单中选择 Mark as plain text 。

source: In the Settings/Preferences dialog, expand the node Build, Execution, Deployment, and click Debugger.
zh_cn: 在 Settings/Preferences 对话框中，展开结点 Build, Execution, Deployment ，然后点击 Debugger 。

source: In the pop-up frame type a string that you think should match your regular expression.
zh_cn: 在弹出框架中，输入一个您认为应该与正则表达式匹配的字符串。

source: In this case the suggestion will be added prepended with negation, which may be useful for boolean expressions.
zh_cn: 在这种情况下，建议将被添加前置否定，这可能对布尔表达式有用。

source: In this case the suggestion will replace the characters to the right of the caret.
zh_cn: 在这种情况下，建议将会替换插入符号右侧的字符。

source: Include
zh_cn: 包含

source: Include &disabled actions
zh_cn: 包含禁用的动作(&D)

source: Include &non-&&menu actions
zh_cn: 包括非菜单操作(&N)

source: Include &non-&&project classes
zh_cn: 包括非项目类(&N)

source: Include &non-&&project files
zh_cn: 包括非项目文件(&N)

source: Include &non-&&project items
zh_cn: 包括非项目项(&N)

source: Include &non-&&project symbols
zh_cn: 包括非项目符号(&N)

source: Include &test sources
zh_cn: 包含测试代码(&T)

source: Include All
zh_cn: 包括全部

source: Include Non-Started Tests into Rerun Failed
zh_cn: 将未开始测试包括到重新运行失败

source: Include Recursively
zh_cn: 递归包含

source: Include Test Dependencies
zh_cn: 包括测试依赖关系

source: Include all the occurrences of a search string in the multiple selection by pressing &shortcut:SelectAllOccurrences;.
zh_cn: 按 &shortcut:SelectAllOccurrences; 将搜索字符串的所有匹配项添加到多选中。

source: Include changes from {0}
zh_cn: 包含 {0} 中的更改

source: Include dependencies with "Provided" scope
zh_cn: 在 "Provided" 作用域中包含依赖项

source: Include in JAR file:
zh_cn: 包含在 JAR 文件中：

source: Include in project &build
zh_cn: 包括在项目构建中(&B)

source: Include into Commit
zh_cn: 包含到提交里

source: Include into commit
zh_cn: 包含到提交里

source: Include non-project items
zh_cn: 包括非项目项

source: Include o&verloaded methods
zh_cn: 包括重载方法(&V)

source: Include subdirectories
zh_cn: 包含子目录

source: Include subpackages
zh_cn: 包括子包

source: Include this usage(s) into processing
zh_cn: 将这些使用包含进来

source: Include/Exclude directory from module
zh_cn: 从模块中包含/排除目录

source: Included file is no longer used.
zh_cn: 包含的文件已不再使用。

source: Includes
zh_cn: 包含

source: Incompatible Configuration{0, choice, 1# Is|2#s Are} Running
zh_cn: 不兼容的配置在运行

source: Incompatible thread state: thread not suspended
zh_cn: 不兼容的线程状态:线程没有暂停

source: Incompatible types for ''{0}'' operation
zh_cn: ''{0}'' 操作不兼容的类型

source: Incompatible types.
zh_cn: 类型不兼容。

source: Inconsistent Resource Bundle
zh_cn: 不一致的资源包

source: Inconsistent count of placeholders: found {0} in ''{1}''
zh_cn: 不一致的占位符数:找到 {0} 在 ''{1}''

source: Inconsistent debug information
zh_cn: 不一致的调试信息

source: Inconsistent line separators
zh_cn: 不一致的换行符

source: Inconsistent property ''{0}''.
zh_cn: 不一致的属性 ''{0}''。

source: Inconsistent property value end ''{0}''
zh_cn: 不一致的属性值结束 ''{0}''

source: Inconsistent property value end ''{0}'' but found ''{1}'' in ''{2}''
zh_cn: 不一致的属性值结尾 ''{0}'',但发现 ''{1}'' 在 ''{2}''

source: Inconvertible types; cannot cast ''{0}'' to ''{1}''
zh_cn: 不可转换的类型;不能将 ''{0}'' 转换为 ''{1}''

source: Incorrect Data
zh_cn: 不正确的数据

source: Incorrect File Type
zh_cn: 不正确的文件类型

source: Incorrect annotation syntax: {0}
zh_cn: 不正确的注解语法: {0}

source: Incorrect function.
zh_cn: 不正确的函数。

source: Incorrect name
zh_cn: 不正确的名称

source: Incorrect pattern
zh_cn: 模式不正确

source: Incorrect reg exp constraint:{0} for {1}
zh_cn: 不正确的正则表达式约束:{0} for {1}

source: Increase Font Size
zh_cn: 增大字体大小

source: Increase image view
zh_cn: 放大图像视图

source: Increase it to {1} MB or more to avoid performance issues.
zh_cn: 增大到 {1} MB 或以上以避免性能问题。

source: Increase the maximum heap size in Project Properties|Compiler settings.
zh_cn: 在 Project Properties|Compiler （项目属性|编译器）设置中增加最大堆大小。

source: Increment Height
zh_cn: 增加高度

source: Increment Width
zh_cn: 增加宽度

source: Incrementa_l Search
zh_cn: 增量搜索(_L)

source: Indent 'break' from 'case'
zh_cn: 缩进 'case' 里的 'break'

source: Indent 'case' branches
zh_cn: 缩进 'case' 分支

source: Indent Block
zh_cn: 缩进块

source: Indent Each Line
zh_cn: 缩进每一行

source: Indent Line or Selection
zh_cn: 缩进行或选中区域

source: Indent Selection
zh_cn: 缩进选中内容

source: Indent continuation lines
zh_cn: 缩进连续行

source: Indent current line or selected block according to the code style settings
zh_cn: 根据代码样式设置缩进当前行或者选中块

source: Indent must be multiple of tab size for smart tabs to operate
zh_cn: 智能 tab 操作的缩进必须是 tab 尺寸的倍数

source: Indent with tab
zh_cn: 用制表符缩进

source: Indent with {0} spaces
zh_cn: 用 {0} 空格缩进

source: Indent:
zh_cn: 缩进：

source: Indents Detection
zh_cn: 缩进检测

source: Indexing...
zh_cn: 索引中...

source: Infer _Nullity...
zh_cn: 推断 Null...(_N)

source: Infer nullity
zh_cn: 推断 Null

source: Inferred type ''{2}'' for type parameter ''{0}'' is not within its bound; should extend ''{1}''
zh_cn: 类型参数 ''{0}'' 的推断类型 ''{2}'' 不在其范围内;应该继承 ''{1}''

source: Inferred type ''{2}'' for type parameter ''{0}'' is not within its bound; should implement ''{1}''
zh_cn: 类型参数 ''{0}'' 的推断类型 ''{2}'' 不在其范围内;应该实现 ''{1}''

source: Information
zh_cn: 信息

source: Information about the frame is not available
zh_cn: 关于帧的信息不可用

source: Information:
zh_cn: 信息:

source: Infrastructure failure
zh_cn: 基础架构故障

source: Inherit project compile output path
zh_cn: 继承项目编译输出路径

source: Inherit values from:
zh_cn: 继承值从：

source: Inheritance issues
zh_cn: 继承问题

source: Inheritor
zh_cn: 继承者

source: Initialization
zh_cn: 初始化

source: Initialization ...
zh_cn: 初始化...

source: Initialization issues
zh_cn: 初始化问题

source: Initialize in
zh_cn: 初始化在

source: Initialize in constructor
zh_cn: 在构造函数中初始化

source: Initialize variable
zh_cn: 初始化变量

source: Initialize variable ''{0}''
zh_cn: 初始化变量 ''{0}''

source: Initializer for ''{0}'' has incompatible type
zh_cn: ''{0}'' 的初始化器具有不兼容的类型

source: Initializer for variable {0} cannot be a constant initializer
zh_cn: 初始化变量的 {0} 不能初始化一个常数

source: Initializer must be able to complete normally
zh_cn: 初始化器必须能够正常完成

source: Initializer type is not assignment-compatible with array's component type
zh_cn: 初始化器类型与数组的组件类型不兼容

source: Initializing VCS...
zh_cn: 初始化 VCS...

source: Initializing project...
zh_cn: 初始化项目...

source: Inline
zh_cn: 内联

source: Inline &all and remove the field
zh_cn: 内联全部并移除该字段(&A)

source: Inline &all and remove the method
zh_cn: 内联全部并移除该方法(&A)

source: Inline &all references and remove the class
zh_cn: 内联所有引用并移除类(&A)

source: Inline &all references and remove the variable
zh_cn: 内联所有的引用并移除变量(&A)

source: Inline ''{0}'' body into the next ''{1}'' call
zh_cn: 内联 ''{0}'' 主体进入下一个 ''{1}'' 调用

source: Inline Artifact
zh_cn: 内联 Artifact

source: Inline Elements
zh_cn: 内联元素

source: Inline Field
zh_cn: 内联字段

source: Inline Method
zh_cn: 内联方法

source: Inline Parameter
zh_cn: 内联参数

source: Inline Parameter {0}
zh_cn: 内联参数 {0}

source: Inline Variable
zh_cn: 内联变量

source: Inline all and k&eep the field
zh_cn: 内联全部并保留该字段(&E)

source: Inline all and k&eep the method
zh_cn: 内联全部并保留该方法(&E)

source: Inline class {0}
zh_cn: 内联类 {0}

source: Inline delegate to the selected field methods
zh_cn: 内联委托给选中字段的方法

source: Inline elements:
zh_cn: 内联元素:

source: Inline field {0}
zh_cn: 内联字段 {0}

source: Inline for varargs parameters is not supported
zh_cn: 不支持内联可变参数

source: Inline included file
zh_cn: 内联包含文件

source: Inline local variable ''{0}'' definition?
zh_cn: 内联局部变量 ''{0}'' 定义？

source: Inline local variable ''{0}''?
zh_cn: 内联局部变量 ''{0}''？

source: Inline parameter ''{0}'' with initializer ''{1}''?
zh_cn: 内联参数 ''{0}'' 初始化 ''{1}''?

source: Inline parameter as constant value
zh_cn: 内联参数为常量值

source: Inline parameter hint
zh_cn: 内联参数提示

source: Inline parameter hint (highlighted)
zh_cn: 内联参数提示(高亮的)

source: Inline parameter hints//Current
zh_cn: 内联参数提示//当前

source: Inline parameter hints//Default
zh_cn: 内联参数提示//默认

source: Inline parameter hints//Highlighted
zh_cn: 内联参数提示//高亮

source: Inline parameter is not supported when method is a part of inheritance hierarchy
zh_cn: 当方法是继承层次结构的一部分时，不支持内联参数

source: Inline runtime classpaths
zh_cn: 内联运行时类路径

source: Inline stream mapping method
zh_cn: 内联流映射方法

source: Inline the contents of ''{0}''?
zh_cn: 内联 ''{0}'' 的内容？

source: Inline the selected method or variable
zh_cn: 内联选中方法或变量

source: Inline this only and &keep the field
zh_cn: 只内联这个，并保留字段(&K)

source: Inline this only and &keep the method
zh_cn: 只内联这个，并保留方法(&K)

source: Inline this reference only and &keep the class
zh_cn: 仅内联该引用并保持类(&K)

source: Inline this reference only and &keep the super class
zh_cn: 只内联这个引用，并保留超类(&K)

source: Inline this reference only and &keep the variable
zh_cn: 只内联这个引用，并保留变量(&K)

source: Inline to Anonymous Class
zh_cn: 内联到匿名类

source: Inline value ''{1}'' for parameter ''{0}''
zh_cn: 参数 ''{0}'' 的内联值 ''{1}''

source: Inline {0}
zh_cn: 内联 {0}

source: Inlined method implements method from {0}
zh_cn: 内联方法实现方法从 {0}

source: Inlined method overrides method from {0}
zh_cn: 内联方法覆盖方法从 {0}

source: Inlined modified values
zh_cn: 内联修改后的值

source: Inlined values
zh_cn: 内联值

source: Inlined values for breakpoint line
zh_cn: 为断点行内联值

source: Inlined values for execution line
zh_cn: 执行行的内联值

source: Inlining method {0}
zh_cn: 内联方法 {0}

source: Inner
zh_cn: 内部的

source: Inner class
zh_cn: 内部类

source: Inner class construction may produce <code>java.lang.NullPointerException</code>
zh_cn: 内部类构告可能产生 <code>java.lang.NullPointerException</code>

source: Inner class named ''{0}'' is already defined in class ''{1}''
zh_cn: 内部类名 ''{0}'' 已定义 在类 ''{1}'' 中

source: Inner class {0} is already defined in class {1}.
zh_cn: 内部类 {0} 已在类 {1} 中定义。

source: Inner class {0} is not static.
zh_cn: 内部类 {0} 不是静态的。

source: Inner classes
zh_cn: 内部类

source: Inner classes cannot have static declarations
zh_cn: 内部类不能有静态声明

source: Inner classes cannot have static members
zh_cn: 内部类不能有静态成员

source: Inner classes:
zh_cn: 内部类：

source: Input
zh_cn: 输入

source: Input Error
zh_cn: 输入错误

source: Input new favorites list name
zh_cn: 输入新收藏列表名

source: Input special characters using macOS system palette
zh_cn: 使用 macOS 系统调色板输入特殊字符

source: Insert
zh_cn: 插入

source: Insert &macro...
zh_cn: 插入宏...(&M)

source: Insert ''({0}){1}'' declaration
zh_cn: 插入 ''({0}){1}'' 声明

source: Insert ''.{0}'' to call functional interface method
zh_cn: 插入 ''.{0}'' 以调用 functional 接口方法

source: Insert ''{0}''
zh_cn: 插入 ''{0}''

source: Insert '('
zh_cn: 插入 '('

source: Insert '()'
zh_cn: 插入 '()'

source: Insert '()' when no arguments
zh_cn: 当没有参数时插入 '()'

source: Insert 'filter(Objects::nonNull)' step
zh_cn: 插入 'filter(Objects::nonNull)' 步骤

source: Insert 'super();'
zh_cn: 插入 'super();'

source: Insert @&Override
zh_cn: 插入 @Override(&O)

source: Insert @&Override annotation
zh_cn: 插入 @Override 注解(&O)

source: Insert Code Template
zh_cn: 插入代码模板

source: Insert Component
zh_cn: 插入组件

source: Insert Live _Template...
zh_cn: 插入代码模板...(_T)

source: Insert Macro
zh_cn: 插入宏

source: Insert New Line Before Tags
zh_cn: 在标签之前插入新行

source: Insert Path
zh_cn: 插入路径

source: Insert a secondary cursor in the line above to edit multiple lines of code simultaneously.
zh_cn: 在上面的行中插入一个辅助光标，以同时编辑多行代码。

source: Insert a secondary cursor in the line below to edit multiple lines of code simultaneously.
zh_cn: 在下面的行中插入一个辅助光标，以同时编辑多行代码。

source: Insert background-image size
zh_cn: 插入背景图像大小

source: Insert documentation comment stub
zh_cn: 插入文档注释存根

source: Insert imports for inner classes
zh_cn: 为内部类插入导入

source: Insert m&acro...
zh_cn: 插入宏...(&A)

source: Insert ma&cro...
zh_cn: 插入宏...(&C)

source: Insert new
zh_cn: 插入 new

source: Insert new line before:
zh_cn: 在之前插入新行:

source: Insert pair '%>' in JSP
zh_cn: 在 JSP 中插入成对 '%>'

source: Insert pair '}'
zh_cn: 插入成对 '}'

source: Insert pair bracket
zh_cn: 插入成对括号

source: Insert pair quote
zh_cn: 插入成对引号

source: Insert paired brackets (), [], {}, <>
zh_cn: 插入成对的括号 (), [], {}, <>

source: Insert required attribute
zh_cn: 插入必需属性

source: Insert required attribute {0}
zh_cn: 插入必需属性 {0}

source: Insert required child tag
zh_cn: 插入所需的子标签

source: Insert required child tag {0}
zh_cn: 插入所需的子标签 {0}

source: Insert single abstract method call
zh_cn: 插入单抽象方法调用

source: Insert underscores into literal
zh_cn: 将下划线插入文字

source: Inserted
zh_cn: 插入

source: Inserts ''if not null'' statement
zh_cn: 插入 ''if not null'' 语句

source: Inserts ''if null'' statement
zh_cn: 插入 ''if null'' 语句

source: Inserts singleton method getInstance
zh_cn: 插入单例方法 getInstance

source: Inspect
zh_cn: 检查

source: Inspect &module ''{0}''
zh_cn: 检查模块 ''{0}''(&M)

source: Inspect ''{0}''
zh_cn: 检查 ''{0}''

source: Inspect Code With _Editor Settings
zh_cn: 检查代码编辑器设置(_E)

source: Inspect Code in Bulk
zh_cn: 批量检查代码

source: Inspect code
zh_cn: 检查代码

source: Inspect the whole &project
zh_cn: 检查整个项目(&P)

source: Inspect...
zh_cn: 检查...

source: Inspecting Code...
zh_cn: 检查代码...
